In [1]:
import os
os.chdir(r'C:\Users\Veena Nigam\Desktop\Python project\Data Cleaning Projects')
os.getcwd()

'C:\\Users\\Veena Nigam\\Desktop\\Python project\\Data Cleaning Projects'

In [2]:
import warnings
warnings.filterwarnings('ignore')

In [3]:
# Importing the numpy and pandas package
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O 


# Data Visualisation
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [4]:
df = pd.read_csv("nyc_uber_2014.csv", usecols=['Date/Time','Lat','Lon','Base'])

In [5]:
df.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 297 entries, 0 to 296
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date/Time  297 non-null    object
 1   Lat        297 non-null    float64
 2   Lon        297 non-null    float64
 3   Base       297 non-null    object
dtypes: float64(2), object(2)
memory usage: 9.4+ KB

In [7]:
# counting missing values
df.apply(lambda x: sum(x.isnull()))

Date/Time    0
Lat          0
Lon          0
Base         0
dtype: int64

##### There are no missing values in the dataset

In [8]:
#gettin columns' names specially sometimes there is a space or unders score in some columns' names
df_columns=df.columns
print(df_columns)

Index(['Date/Time', 'Lat', 'Lon', 'Base'], dtype='object')

In [9]:
#categrocial variables
df_cat=df.select_dtypes(include='object')
df_cat.columns

Index(['Date/Time', 'Base'], dtype='object')

In [10]:
#numerical variables
df_num=df.select_dtypes(exclude='object')# Just get me the numeric variables
df_num.columns

Index(['Lat', 'Lon'], dtype='object')

In [11]:
# Getting the summary of Data
pd.options.display.float_format = "{:.2f}".format
df.describe()# for numeric columns

         Lat    Lon
count 297.00 297.00
mean   40.74 -73.99
std     0.06   0.10
min    40.30 -74.66
25%    40.72 -74.00
50%    40.74 -73.99
75%    40.76 -73.97
max    41.02 -73.46

In [12]:
#finding just unique values
df.apply(lambda x: len(x.unique()))

Date/Time    250
Lat          250
Lon          242
Base           1
dtype: int64

In [13]:
#Find the Frequency of each items

#categorical variables
df_cat=df.select_dtypes(include='object')
df_cat.apply(lambda x:print( x.value_counts()))

6/1/2014 0:08:00    3
5/1/2014 5:38:00    3
5/1/2014 6:07:00    3
6/1/2014 1:00:00    2
4/1/2014 6:14:00    2
                   ..
5/1/2014 5:00:00    1
5/1/2014 1:25:00    1
6/1/2014 0:34:00    1
5/1/2014 1:48:00    1
5/1/2014 5:39:00    1
Name: Date/Time, Length: 250, dtype: int64
B02512    297
Name: Base, dtype: int64

Date/Time    None
Base         None
dtype: object

#### The first column is not named: it seems to be a Serial No.

In [14]:
df['S.No.'] = np.arange(len(df))
cols = list(df.columns)  #column names
cols
cols = [cols[-1]] + cols[:-1] 
df=df[cols]

In [15]:
df.head()

   S.No.         Date/Time   Lat    Lon    Base
0      0  4/1/2014 0:11:00 40.77 -73.95  B02512
1      1  4/1/2014 0:17:00 40.73 -74.03  B02512
2      2  4/1/2014 0:21:00 40.73 -73.99  B02512
3      3  4/1/2014 0:28:00 40.76 -73.98  B02512
4      4  4/1/2014 0:33:00 40.76 -73.97  B02512

#### The date/time column is merged into one, We can split in two columns

In [16]:
df['Date'] = pd.to_datetime(df['Date/Time']).dt.date
df['Time'] = pd.to_datetime(df['Date/Time']).dt.time

In [30]:
df.drop('Date/Time',axis=1,inplace=True)

In [31]:
df.head()

   S.No.   Lat    Lon    Base        Date      Time
0      0 40.77 -73.95  B02512  2014-04-01  00:11:00
1      1 40.73 -74.03  B02512  2014-04-01  00:17:00
2      2 40.73 -73.99  B02512  2014-04-01  00:21:00
3      3 40.76 -73.98  B02512  2014-04-01  00:28:00
4      4 40.76 -73.97  B02512  2014-04-01  00:33:00

#### Rounding the number of decimals in the latitude and lonitude column

In [32]:
decimals = 3    
df['Lat'] = df['Lat'].apply(lambda x: round(x, decimals))
df['Lon'] = df['Lon'].apply(lambda x: round(x, decimals))

In [33]:
df.head()

   S.No.   Lat    Lon    Base        Date      Time
0      0 40.77 -73.95  B02512  2014-04-01  00:11:00
1      1 40.73 -74.03  B02512  2014-04-01  00:17:00
2      2 40.73 -73.99  B02512  2014-04-01  00:21:00
3      3 40.76 -73.98  B02512  2014-04-01  00:28:00
4      4 40.76 -73.97  B02512  2014-04-01  00:33:00